#pragma once


														//TODO 셀렉터 ( 그라운드 몬스터 AI 루트 )  1

											//TODO 시퀀스	2								시퀀스 3
												
										/*! 죽었는가		죽는 액션 및 소멸처리*/			/*! 땅에 있는가*/	 /*TODO 시퀀스4*/									//TODO셀렉터 4
																					
																					//!피격중인가	피격 액션

																										//TODO 시퀀스 5						시퀀스 12											시퀀스 13

																							/*!공격사거리에 있는가*/		/*TODO 셀렉터 6*/	/*!탐색거리에 있는가	추격처리*/			/*! 플레이어는 살았는가?	*/					//TODO 셀렉터 14


																								/*TODO 시퀀스 7*/						/*TODO 셀렉터 8*/										//TODO	시퀀스 15					// 시퀀스 16						
															
																							/*!간볼 것인가	  간보는 액션*/	 /*TODO 시퀀스 9			시퀀스 10					시퀀스11*/			//!도착했나			//! 대기		//! 목표위치 설정		//!움직여라
																																									
																											//!일반 공격할 것인가 , 일반공격 액션,		//! 올려치기 할것인가, 올려치기 액션		//!차징샷 할것인가, 차징샷 액션
															
															
																							
																																	